$(document).ready(()=>{
    selectYearSwitch("1");
});

$('#select-year').on('change', function() {
    let value = $(this).val();
    if(value=="1"){
        selectYearSwitch("1");
    }
    else{
        $('#text').text(selectYearSwitch(value)).html();
    }
});

let selectYearSwitch = (value) => {
    let text="";
    switch(value){
        case "1":
            $('#text').html('');
            let doc=document.querySelector('#text');

            for(let i=2; i<12; ++i){
                doc.append(selectYearSwitch(i.toString()));
                doc.innerHTML+=`<br>`;
            }
            break;
        case "2":
            text="2003 рік. Восьмого лютого о 19:45 у породільному відділені лікарні номер №6 народився Я. Саме від цього моменту починається моя історія. У цьому ж році відбулися мої перші життєві кроки, проте не думаю, що це дуже цікаво.";
            break;
        case "3":
            text="Літо 2007 року, Євпаторія. Це перші спогади які я памʼятаю з дитинства, для моєї памʼяті період від народження і до липня 2007 року не існує. Певно перша поʼїздка на море та перший з двох разів, коли я бував у Криму. Відпочивали з бабусею 3 тижні на морі, памʼятаю, що було весело.";
            break;
        case "4":
            text="2009 рік. \"Перший раз в перший клас\" хоча в дійсності він був єдиним, 33 гімназія міста Дніпро (тоді ще Дніпропетровськ). Не вважаю дуже памʼятною датою, але нехай теж буде тут.";
            break;
        case "5":
            text="2010 рік. Він не повинен був стати важливим для мене, все через те, що всі лікарі казали, що моя молодша сестра Злата народиться у 2011, проте 28 грудня стало дійсно важливою датою, оскільки з самого дитинства я хотів мати сестру і ось це сталося.";
            break;
        case "6":
            text="2013 рік. Напевно тоді я був найщасливішою людиною у світі. У червні я став чемпіоном України з автотрассового спорту, те чого я так хотів стало реальністю. У винагороду я отримав путівку до табору, де провів серпень, до речі це був другий та останній раз коли я був у Криму.";
            break;
        case "7":
            text="2014 рік. Навчаючись у 6 класі я вступаю до найкращої у нашому місті школи англійської мови: \"Школа англійської мови Валерія Соловова\". Засновник цієї школи створив єдину у світі програму навчання засновану на прослуховуванні авторських пісень та вивченні граматики за допомогою таблиць. Закінчивши її я жодного разу не пошкодував про свій вибір.";
            break;
        case "8":
            text="2018 рік. І одразу дві надважливі для мене події. У липні я вперше їду за кордон, це буда поїздка до Варшави, де ми спочатку жили 4 дні у місті, а потім провели тиждень з польськими скаутами у наметовому таборі. У верені я вступаю до 10 классу кращого навчального закладу нашого міста, а саму до фізико-математичного ліцею (ДОЛІФМП). Це місце дало мені дуже багато знань та життєво важливих навичок. Завдяки ліцею я зміг вступити до одного з кращих інститутів України.";
            break;
        case "9":
            text="2019 рік. Трапляється те, що не кожному вдається зробити протягом усього життя. Я прожив місяць у Америці. 10 днів ми провели на всесвітньому зльоті скаутів, а інший час подорожували на автомобілі. Ми відвідали Нью-Йорк, Пітсбург, Баффало, Ніагарський водоспад, національний парк \"Watkins Glen\" та багато інших цікавих місць.";
            break;
        case "10":
            text="2020 рік. Починаючи з нього, я кожен рік намагаюся виконувати хоча б одну маштабну ціль. Тоді, маючи власний інтернет-магазин б/у BMX та майстерню, де я їх ремонтував, я зміг заробити суму, яка тоді здавалася неймовірно великою та купити ноутбук, який я хотів, він став моїм інструментом для навчання, навіть зараз я на ньому це пишу. Також у тому році я вступив до Київського політехнічного інституту, де навчаюсь і зараз.";
            break;
        case "11":
            text="2021 рік. Виконано дві масштабні цілі, які я хотів виконати з самого дитинства. Перша, я отримав посвідчення водія, друга, я придбав свій власний автомобіль, Volkswagen golf. Ціль здавалася неймовірною аж до самого моменту придбання. Проте емоції, що я отримав неперевершені.";
            break;
    }
    return text;
}